{
  "backend/main.mo": "Motoko canister managing blogs, user emails, site-live state, and role-based access control with admin allow‑list bootstrapping.",
  "feature_evidence.json": "Evidence report mapping two domain‑configuration features to their affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files, mainly marketing components, config, and styling.",
  "frontend/DEPLOYMENT.md": "Guide outlining prerequisites and steps for building, deploying, and managing maintenance mode for the IC application.",
  "frontend/index.css": "Tailwind‑based global stylesheet defining OKLCH color variables, dark mode tokens, and base element styling.",
  "frontend/index.html": "Main HTML entry point providing root mount, metadata, and script loader for the Vite React app.",
  "frontend/src/App.tsx": "Root React app configuring routes, global providers, marketing layout, and admin‑gated sections with maintenance‑mode handling.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Guards admin routes by checking Internet Identity authentication and admin status, showing login, denial, or children accordingly.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles Internet Identity login/logout with status feedback and query cache reset.",
  "frontend/src/components/cursor/CustomCursor.tsx": "Empty placeholder component file.",
  "frontend/src/components/forms/StudentEnquiryForm.tsx": "Collects student enquiry details and, upon submission, shows confirmation with WhatsApp, SMS, email, and call options.",
  "frontend/src/components/forms/TeacherEnquiryForm.tsx": "Collects teacher application details and, upon submission, shows confirmation with messaging and contact options.",
  "frontend/src/components/maintenance/MaintenanceScreen.tsx": "Displays a maintenance notice with optional retry button.",
  "frontend/src/components/maintenance/SiteLiveGate.tsx": "Blocks public routes when the site is offline, showing maintenance or error states while allowing admin access.",
  "frontend/src/components/marketing/ContactForm.tsx": "Validates and submits a basic contact form, then shows a thank‑you screen.",
  "frontend/src/components/marketing/MarketingFooter.tsx": "Footer component with brand, navigation links, contact details, and social/WhatsApp/email handlers.",
  "frontend/src/components/marketing/MarketingHeader.tsx": "Responsive header with logo, navigation links, mobile menu, and routing actions.",
  "frontend/src/components/marketing/sections/ContactSection.tsx": "Contact section offering WhatsApp, call, SMS, and email actions with displayed numbers.",
  "frontend/src/components/marketing/sections/FaqSection.tsx": "FAQ accordion rendering questions and answers from site content.",
  "frontend/src/components/marketing/sections/HeroSection.tsx": "Hero banner with headline, actions for student/teacher forms, feature badges, and an image.",
  "frontend/src/components/marketing/sections/HowItWorksSection.tsx": "Four-step explanation of the tutoring process using icon cards.",
  "frontend/src/components/marketing/sections/ServicesSection.tsx": "Service grid showcasing subjects and areas taught with icons and descriptions.",
  "frontend/src/components/marketing/sections/TestimonialsSection.tsx": "Testimonials grid displaying student reviews with star ratings and author info.",
  "frontend/src/components/marketing/sections/TrustStatsSection.tsx": "Renders a marketing stats section showing experience, student count, and teacher count using cards with icons.",
  "frontend/src/components/marketing/sections/ValuePropositionSection.tsx": "Displays four value propositions with icons and descriptions in a responsive card grid.",
  "frontend/src/config/publicDomain.ts": "Provides utilities to get the public domain, full URLs, and asset URLs based on environment variables and fallbacks.",
  "frontend/src/config/siteConfig.ts": "Defines the site name and helpers for generating page titles and accessing branding information.",
  "frontend/src/content/legalContent.ts": "Exports structured Terms & Conditions content with sections dynamically referencing the site name.",
  "frontend/src/content/marketingContent.ts": "Supplies marketing copy including hero text, value propositions, services, steps, and testimonials using SITE_NAME.",
  "frontend/src/content/siteContent.ts": "Contains contact info, form option lists, trust stats, testimonials, and FAQs for use across the site.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCustomCursor.ts": "Empty or placeholder file for a custom cursor hook.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using AuthClient, including login flow, stored identity loading, and status flags.",
  "frontend/src/hooks/usePageMeta.ts": "Updates document title and meta description based on provided page metadata.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD blog operations, user profile actions, and admin checks through the canister actor.",
  "frontend/src/index.css": "Tailwind CSS base and theme configuration with light/dark mode variables and utility classes.",
  "frontend/src/lib/whatsapp.ts": "Generates WhatsApp, SMS, phone, and email links with templated messages for student and teacher inquiries.",
  "frontend/src/main.tsx": "Bootstraps the React app with InternetIdentityProvider and React Query client.",
  "frontend/src/pages/AdminBlogsPage.tsx": "Admin interface for managing blogs with create, edit, publish, delete, and site-live controls.",
  "frontend/src/pages/AdminSetupPage.tsx": "Admin setup screen for initializing admin access, saving email, validating tokens, and displaying identity details.",
  "frontend/src/pages/BlogPostPage.tsx": "Displays a single blog post with loading, not-found, and published checks, using metadata hooks and navigation.",
  "frontend/src/pages/BlogsPage.tsx": "Lists all published blog posts with loading and empty states, including previews and navigation to individual posts.",
  "frontend/src/pages/ContactPage.tsx": "Shows contact options including WhatsApp, phone, SMS, and email with links and actions driven by site config.",
  "frontend/src/pages/HomePage.tsx": "Renders the main homepage composed of multiple marketing sections and sets page metadata.",
  "frontend/src/pages/MarketingLandingPage.tsx": "Standalone marketing landing page that manually sets meta tags and renders marketing sections with header and footer.",
  "frontend/src/pages/SetupChecklistPage.tsx": "Provides a setup checklist for configuring site settings, domain, logo, contacts, and social links.",
  "frontend/src/pages/StudentFormPage.tsx": "Displays the student enquiry form with page metadata and introductory text.",
  "frontend/src/pages/TeacherFormPage.tsx": "Displays the teacher registration form with metadata and header text.",
  "frontend/src/pages/TermsPage.tsx": "Renders terms and conditions content dynamically from legalContent with metadata.",
  "frontend/src/types/backend-augment.d.ts": "Augments the backend interface with an internal admin initialization method for authorization setup.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (including hash routing) and persist them in sessionStorage, plus utilities to clear stored or hash parameters.",
  "frontend/static/growwithtutor-standalone/index.html": "Standalone HTML landing page with domain-configured asset loading, dynamic logo/UTM updates, and full page structure and navigation.",
  "frontend/static/growwithtutor-standalone/README.md": "Explains the standalone landing page structure and how to run it via direct browser opening or a local static server.",
  "frontend/static/growwithtutor-standalone/script.js": "Defines all editable marketing content for the standalone page, including hero text, value props, services, steps, testimonials, and FAQs.",
  "frontend/static/growwithtutor-standalone/styles.css": "Contains all styling for the standalone landing page, including layout, components, typography, colors, and responsive design.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and container settings for the main React app.",
  "project_state.json": "Stores project metadata, domain requirements, existing features, and pending requests, focused on using growithtutor.com as the public domain."
}