{
  "backend/main.mo": "Motoko canister implementing blog CRUD, user profile storage, and permission-checked admin/user operations using AccessControl.",
  "feature_evidence.json": "Feature evidence report listing files, components, and tests related to removing custom cursors in the React and standalone apps.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of numerous frontend files including pages, components, and standalone assets.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH theme variables for light and dark modes and global background/foreground styles.",
  "frontend/index.html": "HTML entry point setting metadata and loading the React app root script.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes, global layout, query client, and theming provider.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Component that restricts access to admin pages based on Internet Identity authentication and admin checks.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button managing Internet Identity authentication state and clearing query cache on logout.",
  "frontend/src/components/cursor/CustomCursor.tsx": "Empty file placeholder for removed custom cursor component.",
  "frontend/src/components/forms/StudentEnquiryForm.tsx": "Student enquiry form collecting details and generating a WhatsApp message, showing a confirmation card after submission.",
  "frontend/src/components/forms/TeacherEnquiryForm.tsx": "Teacher application form capturing multi-select teaching preferences and sending a WhatsApp-ready summary after submission.",
  "frontend/src/components/marketing/ContactForm.tsx": "Simple marketing contact form with client-side validation, simulated submission, and a thank-you state.",
  "frontend/src/components/marketing/MarketingFooter.tsx": "Marketing site footer with navigation links, contact details, social links, and branding.",
  "frontend/src/components/marketing/MarketingHeader.tsx": "Responsive marketing header with navigation, mobile menu, and quick access to the student form.",
  "frontend/src/components/marketing/sections/ContactSection.tsx": "Contact section offering WhatsApp and phone contact options plus navigation to a detailed contact page.",
  "frontend/src/components/marketing/sections/FaqSection.tsx": "Renders a FAQ section using accordion items populated from siteContent FAQs.",
  "frontend/src/components/marketing/sections/HeroSection.tsx": "Displays the main hero banner with headline, CTAs, feature bullets, and an image, with navigation actions.",
  "frontend/src/components/marketing/sections/HowItWorksSection.tsx": "Shows a four‑step process grid explaining how the service works with icons and descriptions.",
  "frontend/src/components/marketing/sections/ServicesSection.tsx": "Lists tutoring service categories in a card grid with icons and short descriptions.",
  "frontend/src/components/marketing/sections/TestimonialsSection.tsx": "Renders testimonial cards with quotes, ratings, and user details from siteContent.",
  "frontend/src/components/marketing/sections/TrustStatsSection.tsx": "Displays trust statistics such as experience, students, and teachers using icon cards.",
  "frontend/src/components/marketing/sections/ValuePropositionSection.tsx": "Presents key value propositions in a grid of cards with icons and brief descriptions.",
  "frontend/src/content/legalContent.ts": "Exports structured terms and conditions content with headings, descriptions, and metadata.",
  "frontend/src/content/marketingContent.ts": "Provides marketing content including hero text, value propositions, services, steps, testimonials, and FAQs.",
  "frontend/src/content/siteContent.ts": "Defines site-wide static content including contact info, social links, subjects, classes, boards, languages, modes, trust stats, testimonials, and FAQs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useCustomCursor.ts": "Empty placeholder hook file with no implementation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity loading, and identity state management.",
  "frontend/src/hooks/usePageMeta.ts": "Updates the document title and meta description based on provided page metadata.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for CRUD blog operations and user profile/admin checks using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, dark mode values, base styles, and utility classes.",
  "frontend/src/lib/whatsapp.ts": "Generates WhatsApp message content for student/teacher forms and builds WhatsApp and phone links.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with query and identity providers before rendering.",
  "frontend/src/pages/AdminBlogsPage.tsx": "Admin interface for creating, editing, publishing, and deleting blog posts with dialog forms and React Query mutations.",
  "frontend/src/pages/BlogPostPage.tsx": "Displays a single blog post by ID with loading, not-found, and published checks, and sets page metadata.",
  "frontend/src/pages/BlogsPage.tsx": "Lists all published blogs with loading skeletons, summaries, and navigation to individual posts.",
  "frontend/src/pages/ContactPage.tsx": "Shows WhatsApp and phone contact options with links and office hours, using configured contact data.",
  "frontend/src/pages/HomePage.tsx": "Renders the main homepage composed of marketing sections and sets basic SEO metadata.",
  "frontend/src/pages/MarketingLandingPage.tsx": "Defines a marketing landing layout with header/footer and manually sets document title and description.",
  "frontend/src/pages/SetupChecklistPage.tsx": "Presents a configuration checklist with completion status using siteContent values.",
  "frontend/src/pages/StudentFormPage.tsx": "Displays the student enquiry form with accompanying metadata and page header.",
  "frontend/src/pages/TeacherFormPage.tsx": "Shows the teacher registration form with metadata and an introductory header.",
  "frontend/src/pages/TermsPage.tsx": "Renders terms and conditions content with title, last updated date, and sectioned text.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, persist, and clear URL and session parameters, including hash-based routing support.",
  "frontend/static/growwithtutor-standalone/index.html": "Defines the static landing page structure with sections rendered dynamically by script.js.",
  "frontend/static/growwithtutor-standalone/README.md": "Explains the standalone HTML/CSS/JS landing page files and how to run them locally.",
  "frontend/static/growwithtutor-standalone/script.js": "Contains a content configuration object used to populate all landing page sections dynamically.",
  "frontend/static/growwithtutor-standalone/styles.css": "Provides styling for the standalone landing page, including layout, typography, and responsive components.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling plugins, theme extensions, and custom colors, fonts, and animations.",
  "project_state.json": "Stores the current project metadata, requirements, features, and architectural notes for the GrowWithTutor site."
}