{
  "backend/main.mo": "Motoko actor managing blog CRUD and user profiles with strict admin/user authorization using AccessControl.",
  "feature_evidence.json": "Feature evidence report listing files, components, and tests for the admin setup UI feature.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries for numerous frontend files related to marketing UI and app structure.",
  "frontend/DEPLOYMENT.md": "Deployment guide describing how to build and deploy the project locally and to IC mainnet.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "HTML entry point loading the React app with Growithtutor SEO metadata.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes, theme provider, query client, and layout.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Route guard that checks Internet Identity authentication and admin status before rendering admin pages.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating with Internet Identity and React Query cache.",
  "frontend/src/components/cursor/CustomCursor.tsx": "Empty component file placeholder for a custom cursor implementation.",
  "frontend/src/components/forms/StudentEnquiryForm.tsx": "Student enquiry form collecting basic details and showing contact options after submission.",
  "frontend/src/components/forms/TeacherEnquiryForm.tsx": "Teacher enquiry form capturing experience and multiple teaching preferences, then displaying contact actions.",
  "frontend/src/components/marketing/ContactForm.tsx": "Simple contact form with validation and a thank‑you state after simulated submission.",
  "frontend/src/components/marketing/MarketingFooter.tsx": "Site footer with navigation links, contact details, and social/WhatsApp/email shortcuts.",
  "frontend/src/components/marketing/MarketingHeader.tsx": "Responsive header with logo, navigation links, and mobile menu toggle.",
  "frontend/src/components/marketing/sections/ContactSection.tsx": "Marketing contact section offering WhatsApp, call, SMS, and email options via UI cards.",
  "frontend/src/components/marketing/sections/FaqSection.tsx": "Renders a FAQ section using an accordion fed by siteContent FAQs.",
  "frontend/src/components/marketing/sections/HeroSection.tsx": "Displays the main hero banner with headline, subtext, CTA buttons, and an image.",
  "frontend/src/components/marketing/sections/HowItWorksSection.tsx": "Shows a four‑step process using cards with icons and descriptions.",
  "frontend/src/components/marketing/sections/ServicesSection.tsx": "Lists tutoring service categories as cards with icons and descriptions.",
  "frontend/src/components/marketing/sections/TestimonialsSection.tsx": "Shows testimonial cards with star ratings and content pulled from siteContent.",
  "frontend/src/components/marketing/sections/TrustStatsSection.tsx": "Displays trust statistics (experience, students, teachers) using icon cards.",
  "frontend/src/components/marketing/sections/ValuePropositionSection.tsx": "Presents value propositions as cards highlighting strengths like expert tutors and results.",
  "frontend/src/content/legalContent.ts": "Exports structured terms and conditions content including sections and last‑updated date.",
  "frontend/src/content/marketingContent.ts": "Provides structured marketing content for hero, value props, services, steps, and testimonials.",
  "frontend/src/content/siteContent.ts": "Defines contact info, form options, trust stats, testimonials, FAQs, and social links used across the site.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useCustomCursor.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, authentication flow, and identity persistence using Dfinity AuthClient.",
  "frontend/src/hooks/usePageMeta.ts": "Sets document title and meta description on page load or update.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for blog CRUD operations and user profile/admin checks using the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining theme colors and typography.",
  "frontend/src/lib/whatsapp.ts": "Generates WhatsApp, SMS, and email links and message templates for student and teacher contact forms.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminBlogsPage.tsx": "Admin interface for listing, creating, editing, publishing, and deleting blogs using dialogs and backend mutation hooks.",
  "frontend/src/pages/AdminSetupPage.tsx": "Bootstrap page for granting admin access via a token, handling authentication state and admin validation.",
  "frontend/src/pages/BlogPostPage.tsx": "Displays a single blog post by ID, showing loading, not‑found, and published content views.",
  "frontend/src/pages/BlogsPage.tsx": "Lists all published blog posts with previews and navigation to full posts, with loading and empty states.",
  "frontend/src/pages/ContactPage.tsx": "Contact page offering WhatsApp, phone, SMS, and email options using site contact info and link helpers.",
  "frontend/src/pages/HomePage.tsx": "Home landing page composed of multiple marketing sections with metadata setup.",
  "frontend/src/pages/MarketingLandingPage.tsx": "Standalone marketing landing layout that sets page metadata manually and renders marketing sections with header and footer.",
  "frontend/src/pages/SetupChecklistPage.tsx": "Renders a setup checklist page listing configuration items with statuses and details. Uses page metadata and UI components to display each item.",
  "frontend/src/pages/StudentFormPage.tsx": "Displays the student enquiry form with page metadata and a styled header section. Embeds StudentEnquiryForm.",
  "frontend/src/pages/TeacherFormPage.tsx": "Renders the teacher registration form with metadata and a header section. Embeds TeacherEnquiryForm.",
  "frontend/src/pages/TermsPage.tsx": "Displays terms and conditions content from legalContent with metadata and section rendering. Maps over sections to show titles and text.",
  "frontend/src/types/backend-augment.d.ts": "Augments the backend interface with an internal admin initialization method. Adds a secret-based access control initializer.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session parameters. Supports persisted parameters and hash-based routing.",
  "frontend/static/growwithtutor-standalone/index.html": "Static HTML layout for the standalone landing page with sections populated by script.js. Includes header, navigation, sections, and footer.",
  "frontend/static/growwithtutor-standalone/README.md": "Describes the standalone static landing page and how to run it locally. Lists included HTML, CSS, and JS files.",
  "frontend/static/growwithtutor-standalone/script.js": "Defines editable content objects for the standalone landing page including hero, services, steps, testimonials, and FAQs. Drives dynamic rendering in index.html.",
  "frontend/static/growwithtutor-standalone/styles.css": "CSS styles for the standalone landing page covering layout, typography, sections, buttons, and responsive design.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, fonts, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project metadata, existing features, and pending admin‑related feature requests for granting admin access and bootstrap initialization."
}