{
  "backend/main.mo": "Motoko actor implementing blog storage, siteLive maintenance mode, email management, and admin-role access control with allow‑list bootstrapping.",
  "backend/migration.mo": "Migration module converting the old Boolean siteLive field to an optional Bool for upgrades.",
  "feature_evidence.json": "Feature evidence report mapping product requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files used for build planning.",
  "frontend/DEPLOYMENT.md": "Deployment guide covering local and mainnet builds, maintenance mode operation, and domain configuration steps.",
  "frontend/index.css": "Tailwind-based global CSS defining OKLCH color variables, dark mode tokens, and base element styling.",
  "frontend/index.html": "Base HTML entry point loading Vite bundle and defining initial page metadata.",
  "frontend/src/App.tsx": "Root React application configuring routes, theming, query client, and maintenance gating for public pages.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Guards admin routes by checking Internet Identity authentication and admin status, showing login, denial, or children accordingly.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity with handling for login state and errors.",
  "frontend/src/components/cursor/CustomCursor.tsx": "Empty placeholder component file.",
  "frontend/src/components/forms/StudentEnquiryForm.tsx": "Collects student enquiry details, validates required fields, and after submission shows a summary with contact action links.",
  "frontend/src/components/forms/TeacherEnquiryForm.tsx": "Collects teacher application details with multi-select fields and shows a summary with contact links after submission.",
  "frontend/src/components/maintenance/MaintenanceScreen.tsx": "Displays a maintenance mode message with optional retry button.",
  "frontend/src/components/maintenance/SiteLiveGate.tsx": "Blocks public access when the site is not live, showing maintenance or error states while allowing admin routes through.",
  "frontend/src/components/marketing/ContactForm.tsx": "Simple contact form with validation, simulated submission, and a post-submit confirmation screen.",
  "frontend/src/components/marketing/MarketingFooter.tsx": "Renders the marketing footer with brand info, quick links, contact options, and logo handling logic.",
  "frontend/src/components/marketing/MarketingHeader.tsx": "Implements a responsive header with navigation links, mobile menu toggle, and logo display.",
  "frontend/src/components/marketing/sections/ContactSection.tsx": "Provides a contact section with WhatsApp, call, SMS, and email actions using site contact data.",
  "frontend/src/components/marketing/sections/FaqSection.tsx": "Displays an accordion-based FAQ list sourced from site content.",
  "frontend/src/components/marketing/sections/HeroSection.tsx": "Shows the main hero banner with headline, CTA buttons, feature highlights, and a hero image.",
  "frontend/src/components/marketing/sections/HowItWorksSection.tsx": "Outlines four steps of the service process using icon cards.",
  "frontend/src/components/marketing/sections/ServicesSection.tsx": "Lists tutoring service categories with icons and descriptions.",
  "frontend/src/components/marketing/sections/TestimonialsSection.tsx": "Displays testimonial cards with ratings, quotes, and author details.",
  "frontend/src/components/marketing/sections/TrustStatsSection.tsx": "Displays three trust metrics (experience, students, teachers) using cards and icons in a marketing section.",
  "frontend/src/components/marketing/sections/ValuePropositionSection.tsx": "Renders a grid of value propositions with icons and descriptions explaining key benefits of the service.",
  "frontend/src/config/publicDomain.ts": "Provides utilities to determine the public domain and construct fully qualified URLs for assets and links.",
  "frontend/src/config/siteConfig.ts": "Defines the site name and helpers for generating page titles and retrieving branding info.",
  "frontend/src/content/legalContent.ts": "Exports structured Terms & Conditions content using the site name dynamically.",
  "frontend/src/content/marketingContent.ts": "Contains marketing copy for hero, value props, services, steps, and testimonials using the site name.",
  "frontend/src/content/siteContent.ts": "Provides contact info, form options, trust stats, testimonials, and FAQs for the site.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages a backend actor based on user identity, handling authentication and query invalidation.",
  "frontend/src/hooks/useCustomCursor.ts": "Empty file with no implemented logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and provider for Internet Identity authentication, handling login, stored identities, and status states.",
  "frontend/src/hooks/usePageMeta.ts": "Hook that sets the page title and meta description in the document head.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for blog CRUD operations, user profile access, and admin checks via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration defining global styles, color variables, dark mode, and utility classes.",
  "frontend/src/lib/whatsapp.ts": "Utilities to generate WhatsApp, SMS, email, and Gmail compose links with prefilled messages for students and teachers.",
  "frontend/src/main.tsx": "App entry point that initializes React, React Query, and InternetIdentityProvider, then renders the main App component.",
  "frontend/src/pages/AdminBlogsPage.tsx": "Admin interface for managing blog posts, including creation, editing, publishing, and deletion with UI dialogs.",
  "frontend/src/pages/AdminSetupPage.tsx": "Admin setup page enabling identity-based bootstrap, email setup, and admin status verification.",
  "frontend/src/pages/BlogPostPage.tsx": "Displays a single blog post with loading states, fallback handling, and metadata updates.",
  "frontend/src/pages/BlogsPage.tsx": "Lists all published blogs with previews, loading skeletons, and navigation to full posts.",
  "frontend/src/pages/ContactPage.tsx": "Shows multiple contact methods with buttons for WhatsApp, phone, SMS, and email actions.",
  "frontend/src/pages/HomePage.tsx": "Homepage composing marketing sections and setting basic metadata.",
  "frontend/src/pages/MarketingLandingPage.tsx": "Standalone marketing landing page with manual metadata setup and marketing sections.",
  "frontend/src/pages/SetupChecklistPage.tsx": "Interactive setup checklist detailing configuration items like domain, logo, and contacts.",
  "frontend/src/pages/StudentFormPage.tsx": "Renders the student enquiry form with metadata and simple layout.",
  "frontend/src/pages/TeacherFormPage.tsx": "Renders the teacher registration form with metadata and descriptive intro.",
  "frontend/src/pages/TermsPage.tsx": "Displays legal terms and conditions sourced from structured content.",
  "frontend/src/types/backend-augment.d.ts": "Augments the backend interface with an internal admin initialization method.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and hash parameters, persist them in sessionStorage, and clear them from storage or the hash.",
  "frontend/static/growwithtutor-standalone/index.html": "HTML for the standalone GrowWithTutor landing page, including domain config, dynamic logo loading, and navigation structure.",
  "frontend/static/growwithtutor-standalone/README.md": "Explains the standalone GrowWithTutor landing page files and how to run them via direct file opening or a local server.",
  "frontend/static/growwithtutor-standalone/script.js": "Contains structured content data used to populate text, sections, and UI elements on the standalone landing page.",
  "frontend/static/growwithtutor-standalone/styles.css": "Defines all styling for the standalone landing page, including layout, colors, typography, and responsive behavior.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme options, colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Metadata file describing project state, features, and pending requests related to domain changes and maintenance mode."
}