{
  "backend/main.mo": "Motoko actor implementing blog storage, user email management, and admin-role access control with allow‑list admin bootstrap and site maintenance flag.",
  "feature_evidence.json": "Feature evidence report mapping deployment‑related features to their associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend files, including styling, configuration, marketing components, and static assets.",
  "frontend/DEPLOYMENT.md": "Deployment guide detailing local setup, build steps, and instructions for promoting Version 30 to mainnet with verification steps and production notes.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables, light/dark mode tokens, and base element styling.",
  "frontend/index.html": "Root HTML entry file setting metadata, favicon, viewport, and bootstrapping the React application.",
  "frontend/src/App.tsx": "Main React application configuring TanStack Router routes, global providers, and layout with site‑live gating and admin route protection.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Protects admin routes by checking Internet Identity authentication and admin status, showing login or access‑denied screens when needed.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button that triggers Internet Identity auth flow and clears cached queries on logout.",
  "frontend/src/components/cursor/CustomCursor.tsx": "Empty placeholder component with no implementation.",
  "frontend/src/components/forms/StudentEnquiryForm.tsx": "Student enquiry form that validates required fields and, upon submission, displays a summary with WhatsApp, SMS, email, and phone contact actions.",
  "frontend/src/components/forms/TeacherEnquiryForm.tsx": "Teacher enquiry form collecting experience and teaching details, then showing a summary with messaging and contact options after submission.",
  "frontend/src/components/maintenance/MaintenanceScreen.tsx": "Displays a maintenance notice with an optional retry button.",
  "frontend/src/components/maintenance/SiteLiveGate.tsx": "Gates public routes based on site live status, showing loaders, errors, or maintenance screen while allowing admin routes through.",
  "frontend/src/components/marketing/ContactForm.tsx": "Simple contact form with validation and a submission confirmation screen.",
  "frontend/src/components/marketing/MarketingFooter.tsx": "Renders a marketing footer with branding, quick links, contact options, and social/media actions, handling navigation and email/WhatsApp links.",
  "frontend/src/components/marketing/MarketingHeader.tsx": "Provides a responsive header with logo, navigation links, and mobile menu toggle for the marketing site.",
  "frontend/src/components/marketing/sections/ContactSection.tsx": "Displays WhatsApp, call, SMS, and email contact options using cards with actionable buttons.",
  "frontend/src/components/marketing/sections/FaqSection.tsx": "Shows an accordion-based FAQ list sourced from site content.",
  "frontend/src/components/marketing/sections/HeroSection.tsx": "Provides the main hero banner with headline, CTAs, feature highlights, and a hero image.",
  "frontend/src/components/marketing/sections/HowItWorksSection.tsx": "Outlines four steps of the service workflow using icon cards.",
  "frontend/src/components/marketing/sections/ServicesSection.tsx": "Lists tutoring service categories with icons and descriptions.",
  "frontend/src/components/marketing/sections/TestimonialsSection.tsx": "Displays testimonial cards with ratings, quotes, and author info.",
  "frontend/src/components/marketing/sections/TrustStatsSection.tsx": "Displays three trust statistics cards using values from siteContent with icons and styled layout.",
  "frontend/src/components/marketing/sections/ValuePropositionSection.tsx": "Renders four value-proposition cards with icons and descriptions explaining key tutoring benefits.",
  "frontend/src/config/logoConfig.ts": "Provides a centralized function to determine the correct logo URL using environment variables, local paths, or public domain settings.",
  "frontend/src/config/publicDomain.ts": "Defines helpers to get the public domain, full public URL, and asset URLs based on environment variables or window hostname.",
  "frontend/src/config/siteConfig.ts": "Holds site branding constants like site name and utilities for generating page titles.",
  "frontend/src/content/legalContent.ts": "Exports structured terms and conditions content with sections referencing the site name.",
  "frontend/src/content/marketingContent.ts": "Contains marketing copy including hero text, value propositions, services, steps, and testimonials.",
  "frontend/src/content/siteContent.ts": "Provides contact info, social links, form options, trust stats, testimonials, and FAQs for site use.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on Internet Identity and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useCustomCursor.ts": "Empty placeholder file for a custom cursor hook.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including login, logout, and loading identities from storage.",
  "frontend/src/hooks/usePageMeta.ts": "Custom hook that updates the document title and description meta tag based on provided page metadata.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend blog and user APIs, including fetching, creating, editing, and deleting blogs and user profiles.",
  "frontend/src/index.css": "Tailwind CSS configuration defining theme variables, dark mode styles, and base typography and utility classes.",
  "frontend/src/lib/whatsapp.ts": "Utility functions to generate WhatsApp, SMS, phone, and email links and prefabricated messages for student and teacher inquiries.",
  "frontend/src/main.tsx": "Application entry point that mounts React, sets up React Query, and wraps the app in the Internet Identity provider.",
  "frontend/src/pages/AdminBlogsPage.tsx": "Admin interface for managing blogs, including creating, editing, publishing, and deleting posts, with site-live controls.",
  "frontend/src/pages/AdminSetupPage.tsx": "Admin setup page for bootstrapping admin access, managing email, and validating identity via Internet Identity and a secret token.",
  "frontend/src/pages/BlogPostPage.tsx": "Displays a single blog post, handling loading, not-found states, and metadata updates.",
  "frontend/src/pages/BlogsPage.tsx": "Lists all published blogs with previews and navigation to individual posts.",
  "frontend/src/pages/ContactPage.tsx": "Shows contact options including WhatsApp, phone, SMS, and email with actionable buttons.",
  "frontend/src/pages/HomePage.tsx": "Renders the main homepage composed of multiple marketing sections with metadata setup.",
  "frontend/src/pages/MarketingLandingPage.tsx": "Standalone marketing landing page with manual meta tag updates and full marketing section layout.",
  "frontend/src/pages/SetupChecklistPage.tsx": "Provides a detailed setup checklist for configuring site metadata, domain, logos, and related settings.",
  "frontend/src/pages/StudentFormPage.tsx": "Displays the student enquiry form with header and metadata configuration.",
  "frontend/src/pages/TeacherFormPage.tsx": "Displays the teacher registration form with header and metadata configuration.",
  "frontend/src/pages/TermsPage.tsx": "Shows terms and conditions content with metadata and structured legal sections.",
  "frontend/src/types/backend-augment.d.ts": "Augments the backend interface with an internal admin initialization method.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL or hash params, persist them in sessionStorage, and manage stored parameters.",
  "frontend/static/growwithtutor-standalone/index.html": "HTML page for the standalone GrowWithTutor landing site with configurable branding and multiple sections.",
  "frontend/static/growwithtutor-standalone/README.md": "Explains the standalone GrowWithTutor landing page structure and how to run it locally.",
  "frontend/static/growwithtutor-standalone/script.js": "Defines editable content data for the standalone landing page, including hero, services, steps, testimonials, and FAQ.",
  "frontend/static/growwithtutor-standalone/styles.css": "CSS styling for the standalone GrowWithTutor landing page, covering layout, typography, components, and responsive design.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme tokens, animations, and plugin usage for the frontend build.",
  "project_state.json": "Metadata describing the project state, including features, requirements, and deployment progress."
}