{
  "backend/main.mo": "Motoko canister managing blogs, user profiles, and email-based admin permissions with access-control checks.",
  "feature_evidence.json": "Feature evidence report mapping logo-related updates to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files, including marketing components, pages, and static assets.",
  "frontend/DEPLOYMENT.md": "Guide describing prerequisites and steps for building and deploying the app to a local replica or the IC mainnet.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables, dark mode variants, and global element styling.",
  "frontend/index.html": "Root HTML file setting page metadata and bootstrapping the React app.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes, global providers, and shared layout with header and footer.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Component enforcing admin access using Internet Identity, allowlist checks, and loading/auth states.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity and clears React Query cache on logout.",
  "frontend/src/components/cursor/CustomCursor.tsx": "Empty placeholder component with no implementation.",
  "frontend/src/components/forms/StudentEnquiryForm.tsx": "Handles student enquiry form with validation and generates WhatsApp, SMS, and email follow‑up actions after submission.",
  "frontend/src/components/forms/TeacherEnquiryForm.tsx": "Handles teacher enquiry form with multi-select fields and generates WhatsApp, SMS, and email follow‑up actions once submitted.",
  "frontend/src/components/marketing/ContactForm.tsx": "Implements a contact form with email validation, error handling, and a thank-you state after simulated submission.",
  "frontend/src/components/marketing/MarketingFooter.tsx": "Renders marketing footer with logo, navigation links, and contact options including WhatsApp and email.",
  "frontend/src/components/marketing/MarketingHeader.tsx": "Renders site header with navigation links, responsive mobile menu, and logo handling.",
  "frontend/src/components/marketing/sections/ContactSection.tsx": "Renders a contact section with WhatsApp, phone, SMS, and email actions using links and buttons.",
  "frontend/src/components/marketing/sections/FaqSection.tsx": "Displays an accordion list of FAQ items sourced from site content.",
  "frontend/src/components/marketing/sections/HeroSection.tsx": "Provides the landing hero with headline, CTA buttons, feature highlights, and a hero image.",
  "frontend/src/components/marketing/sections/HowItWorksSection.tsx": "Shows a four‑step explanation of the service workflow using cards and icons.",
  "frontend/src/components/marketing/sections/ServicesSection.tsx": "Lists tutoring services by subject with icons and descriptions.",
  "frontend/src/components/marketing/sections/TestimonialsSection.tsx": "Displays student testimonials with ratings and author details.",
  "frontend/src/components/marketing/sections/TrustStatsSection.tsx": "Shows trust statistics like experience, students taught, and teacher count with icons.",
  "frontend/src/components/marketing/sections/ValuePropositionSection.tsx": "Highlights key value propositions such as expert tutors, personalization, flexibility, and results.",
  "frontend/src/content/legalContent.ts": "Defines the Terms & Conditions content structure including sections, titles, and last‑updated info.",
  "frontend/src/content/marketingContent.ts": "Defines marketing content including hero text, value propositions, services, steps, testimonials, and FAQ data for the site.",
  "frontend/src/content/siteContent.ts": "Provides contact info, social links, form option lists, trust stats, testimonials, and FAQ data for site configuration.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor and invalidates queries when identity changes.",
  "frontend/src/hooks/useCustomCursor.ts": "Empty placeholder hook file for custom cursor functionality.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, logout, identity persistence, and status tracking.",
  "frontend/src/hooks/usePageMeta.ts": "Hook to set the document title and meta description on page load.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for blog operations and user profile/admin checks using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining design tokens, dark mode variables, base styles, and utility classes.",
  "frontend/src/lib/whatsapp.ts": "Provides utilities to generate WhatsApp, SMS, phone, and email links along with prefilled messages for students and teachers.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/pages/AdminBlogsPage.tsx": "Admin interface for creating, editing, publishing, and deleting blog posts.",
  "frontend/src/pages/AdminSetupPage.tsx": "Admin setup flow to validate identity, save email, and activate admin access using a bootstrap token.",
  "frontend/src/pages/BlogPostPage.tsx": "Displays a single blog post with metadata, loading states, and fallback for unpublished posts.",
  "frontend/src/pages/BlogsPage.tsx": "Lists all published blog posts with previews and navigation to individual posts.",
  "frontend/src/pages/ContactPage.tsx": "Contact page offering WhatsApp, phone, SMS, and email options with auto-generated links.",
  "frontend/src/pages/HomePage.tsx": "Home page assembling marketing sections and setting SEO metadata.",
  "frontend/src/pages/MarketingLandingPage.tsx": "Renders the marketing landing page layout and sets the page title and meta description on mount.",
  "frontend/src/pages/SetupChecklistPage.tsx": "Displays a configurable setup checklist with statuses and details for site configuration items.",
  "frontend/src/pages/StudentFormPage.tsx": "Sets meta tags and renders the student enquiry form page layout.",
  "frontend/src/pages/TeacherFormPage.tsx": "Sets meta tags and renders the teacher registration form page layout.",
  "frontend/src/pages/TermsPage.tsx": "Displays terms and conditions content using legalContent with page metadata configuration.",
  "frontend/src/types/backend-augment.d.ts": "Extends the backend interface with an internal admin initialization method for access control.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL and session parameters, including hash routing support.",
  "frontend/static/growwithtutor-standalone/index.html": "Standalone static HTML landing page with sections for hero, services, workflow, testimonials, FAQ, and contact.",
  "frontend/static/growwithtutor-standalone/README.md": "Explains the standalone static landing page files and how to run them locally.",
  "frontend/static/growwithtutor-standalone/script.js": "Defines editable content data for the standalone landing page including hero text, services, steps, testimonials, and FAQs.",
  "frontend/static/growwithtutor-standalone/styles.css": "Defines global styles, color variables, layout, and responsive components for the standalone marketing page including header, hero, and buttons.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, fonts, animations, and container settings for the project.",
  "project_state.json": "Tracks project state, feature requirements, and issues related to updating branding with a provided logo URL."
}