{
  "backend/main.mo": "Motoko backend with blog storage, user profiles, email management, and admin allowlist logic using AccessControl and authorization mixins.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected files, components, and tests with high confidence.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing styling, components, pages, and content configuration.",
  "frontend/DEPLOYMENT.md": "Guide explaining how to build and deploy the project locally and to the Internet Computer mainnet.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens, light/dark theme variables, and global element styling.",
  "frontend/index.html": "Frontend HTML entry point loading the Vite bundle with fixed title and meta description.",
  "frontend/src/App.tsx": "Main React app configuring routing, theme, query client, layout, and all page routes.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Component protecting admin routes by checking Internet Identity authentication and admin status with fallback UI.",
  "frontend/src/components/auth/LoginButton.tsx": "Button component handling Internet Identity login/logout with status-aware UI updates.",
  "frontend/src/components/cursor/CustomCursor.tsx": "Empty file placeholder for custom cursor implementation.",
  "frontend/src/components/forms/StudentEnquiryForm.tsx": "A student enquiry form that collects basic details and, after validation, displays a summary with links to contact via WhatsApp, SMS, phone, or email.",
  "frontend/src/components/forms/TeacherEnquiryForm.tsx": "A teacher application form capturing experience and multiple selections, then showing a confirmation with contact links after submission.",
  "frontend/src/components/marketing/ContactForm.tsx": "A simple contact form with validation and a mock submission flow that displays a thank-you message on completion.",
  "frontend/src/components/marketing/MarketingFooter.tsx": "A marketing site footer showing branding, navigation links, and contact shortcuts for WhatsApp, email, and social links.",
  "frontend/src/components/marketing/MarketingHeader.tsx": "A responsive marketing header with navigation links, logo, and mobile menu toggle.",
  "frontend/src/components/marketing/sections/ContactSection.tsx": "A contact section offering WhatsApp, phone, SMS, and email options with quick-action buttons.",
  "frontend/src/components/marketing/sections/FaqSection.tsx": "Renders a FAQ section using an accordion populated from site content.",
  "frontend/src/components/marketing/sections/HeroSection.tsx": "Displays the hero banner with headline, description, CTAs, and an image, handling navigation on button clicks.",
  "frontend/src/components/marketing/sections/HowItWorksSection.tsx": "Shows a four-step process using cards with icons and descriptions.",
  "frontend/src/components/marketing/sections/ServicesSection.tsx": "Lists tutoring services as cards with icons, titles, and descriptions.",
  "frontend/src/components/marketing/sections/TestimonialsSection.tsx": "Displays testimonial cards with ratings, quotes, authors, and roles.",
  "frontend/src/components/marketing/sections/TrustStatsSection.tsx": "Shows trust metrics using cards with icons, numeric values, and labels.",
  "frontend/src/components/marketing/sections/ValuePropositionSection.tsx": "Presents value propositions in card format with icons, titles, and descriptions.",
  "frontend/src/config/siteConfig.ts": "Defines the site name and helper functions for generating page titles and retrieving the site name.",
  "frontend/src/content/legalContent.ts": "Provides terms and conditions content with sections referencing the site name.",
  "frontend/src/content/marketingContent.ts": "Contains structured marketing content for hero, value proposition, services, how-it-works, and testimonials sections.",
  "frontend/src/content/siteContent.ts": "Provides static site data including contact info, social links, form options, trust stats, testimonials, and FAQs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useCustomCursor.ts": "Empty placeholder hook with no implementation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for managing authentication, stored identities, and login state.",
  "frontend/src/hooks/usePageMeta.ts": "Updates document title and meta description based on provided values.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for blog operations and user profile/admin checks using the backend actor.",
  "frontend/src/index.css": "Sets Tailwind base styles and custom theme variables for light and dark modes.",
  "frontend/src/lib/whatsapp.ts": "Generates WhatsApp, phone, SMS, and email links along with formatted messages for student and teacher inquiries.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AdminBlogsPage.tsx": "Admin interface for listing, creating, editing, publishing, and deleting blog posts with dialog-driven forms and query mutations.",
  "frontend/src/pages/AdminSetupPage.tsx": "Handles admin bootstrap flow including email setup, token submission, and admin status verification using Internet Identity.",
  "frontend/src/pages/BlogPostPage.tsx": "Displays a single blog post by ID with loading and not-found states, using metadata hooks and navigation.",
  "frontend/src/pages/BlogsPage.tsx": "Lists published blog posts with previews and navigation to individual posts, including loading skeletons.",
  "frontend/src/pages/ContactPage.tsx": "Shows contact options like WhatsApp, phone, SMS, and email, using configured contact data and link utilities.",
  "frontend/src/pages/HomePage.tsx": "Home page assembling multiple marketing sections with SEO metadata.",
  "frontend/src/pages/MarketingLandingPage.tsx": "Standalone marketing landing page that manually sets meta tags and renders marketing sections with header and footer.",
  "frontend/src/pages/SetupChecklistPage.tsx": "Renders a setup checklist page with configurable site settings and status indicators using content constants.",
  "frontend/src/pages/StudentFormPage.tsx": "Displays the student enquiry form page and sets metadata for the route.",
  "frontend/src/pages/TeacherFormPage.tsx": "Shows the teacher registration form page and applies page metadata.",
  "frontend/src/pages/TermsPage.tsx": "Renders the terms and conditions page using legal content sections with metadata.",
  "frontend/src/types/backend-augment.d.ts": "Augments the backend actor interface with an internal admin initialization method.",
  "frontend/src/utils/urlParams.ts": "Provides functions to read, store, and manage URL and session parameters including hash-based routing.",
  "frontend/static/growwithtutor-standalone/index.html": "Static HTML landing page defining layout, sections, and structure for the GrowWithTutor marketing site.",
  "frontend/static/growwithtutor-standalone/README.md": "Explains how to run the standalone static GrowWithTutor landing page and its file structure.",
  "frontend/static/growwithtutor-standalone/script.js": "Contains editable content data and logic powering the standalone landing page’s dynamic sections.",
  "frontend/static/growwithtutor-standalone/styles.css": "Defines global styles, color variables, layout, header, hero section, buttons, and responsive behavior for the standalone landing page.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom fonts, colors, radius, shadows, animations, and plugin integrations for project-wide styling.",
  "project_state.json": "Stores project metadata, existing features, and pending feature requests related to adding +91 prefixes and maintaining phone/WhatsApp/SMS link functionality."
}