{
  "backend/main.mo": "Motoko backend implementing blog, user email, and access control logic with admin allowlist and profile queries.",
  "feature_evidence.json": "Feature‑evidence report mapping feature IDs to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten map of frontend file paths to short summaries used as reference metadata.",
  "frontend/DEPLOYMENT.md": "Deployment guide covering local/mainnet steps and instructions for updating domain and DNS settings.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color tokens, light/dark modes, and global element styling.",
  "frontend/index.html": "Base HTML entry point loading the React app with default title, meta tags, and root mount point.",
  "frontend/src/App.tsx": "Main React app wiring routes, layout, theme, query client, and marketing/admin pages using TanStack Router.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Protects admin routes by checking Internet Identity authentication and admin status, rendering login, denial, or child content accordingly.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity with status handling and query cache clearing.",
  "frontend/src/components/cursor/CustomCursor.tsx": "Empty placeholder component for a custom cursor.",
  "frontend/src/components/forms/StudentEnquiryForm.tsx": "Handles a student enquiry form with validation and generates WhatsApp, SMS, and email follow‑up actions after submission.",
  "frontend/src/components/forms/TeacherEnquiryForm.tsx": "Manages a teacher application form with multi‑select fields and sends WhatsApp, SMS, and email options after submission.",
  "frontend/src/components/marketing/ContactForm.tsx": "Implements a contact form with validation, simulated submission, and a thank‑you confirmation state.",
  "frontend/src/components/marketing/MarketingFooter.tsx": "Renders a marketing footer with branding, navigation links, and contact actions including WhatsApp and email.",
  "frontend/src/components/marketing/MarketingHeader.tsx": "Responsive marketing header with navigation links, logo handling, and mobile menu toggle.",
  "frontend/src/components/marketing/sections/ContactSection.tsx": "Contact section offering WhatsApp, call, SMS, and email options using site contact info.",
  "frontend/src/components/marketing/sections/FaqSection.tsx": "FAQ section rendering a list of expandable questions and answers from site content.",
  "frontend/src/components/marketing/sections/HeroSection.tsx": "Hero banner with headline, CTAs for student and teacher forms, feature highlights, and a hero image.",
  "frontend/src/components/marketing/sections/HowItWorksSection.tsx": "Four-step process section explaining how the tutoring service works with icons and descriptions.",
  "frontend/src/components/marketing/sections/ServicesSection.tsx": "Services grid showcasing tutoring subjects with icons, titles, and brief descriptions.",
  "frontend/src/components/marketing/sections/TestimonialsSection.tsx": "Testimonials section displaying student feedback with ratings and author info.",
  "frontend/src/components/marketing/sections/TrustStatsSection.tsx": "Stats section highlighting experience, student count, and teacher count with icons.",
  "frontend/src/components/marketing/sections/ValuePropositionSection.tsx": "Value proposition grid outlining key benefits like expert tutors, personalization, flexibility, and results.",
  "frontend/src/config/publicDomain.ts": "Provides functions to resolve the app's public domain and build full URLs using environment variables or fallbacks.",
  "frontend/src/config/siteConfig.ts": "Defines the site name and helpers for generating page titles and accessing branding info.",
  "frontend/src/content/legalContent.ts": "Contains structured terms and conditions content using the site name for dynamic insertion.",
  "frontend/src/content/marketingContent.ts": "Provides marketing copy including hero text, value propositions, services, steps, and testimonials.",
  "frontend/src/content/siteContent.ts": "Stores contact info, social links, form options, trust stats, testimonials, and FAQs for site display.",
  "frontend/src/hooks/useActor.ts": "React hook that initializes and manages a backend actor based on Internet Identity authentication.",
  "frontend/src/hooks/useCustomCursor.ts": "Empty placeholder file for a custom cursor hook.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements context and hooks for managing Internet Identity auth, login, logout, and identity persistence.",
  "frontend/src/hooks/usePageMeta.ts": "Hook for setting page title and meta description based on provided options.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating blog data, user profiles, and admin status via an actor API.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes with global typography and utility classes.",
  "frontend/src/lib/whatsapp.ts": "Generates WhatsApp, SMS, phone, and email links along with message builders for student and teacher forms.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers before rendering the main App component.",
  "frontend/src/pages/AdminBlogsPage.tsx": "Admin interface for creating, editing, publishing, and deleting blogs using React Query mutations and dialogs.",
  "frontend/src/pages/AdminSetupPage.tsx": "Admin setup flow handling email registration, admin token submission, and identity-based admin verification.",
  "frontend/src/pages/BlogPostPage.tsx": "Displays a single blog post with loading states and fallback when unpublished or missing.",
  "frontend/src/pages/BlogsPage.tsx": "Displays a list of published blog posts with loading skeletons and navigation to individual posts.",
  "frontend/src/pages/ContactPage.tsx": "Provides WhatsApp, phone, SMS, and email contact options using card-based UI and helper link utilities.",
  "frontend/src/pages/HomePage.tsx": "Renders the main homepage composed of multiple marketing sections with metadata setup.",
  "frontend/src/pages/MarketingLandingPage.tsx": "Implements a standalone marketing landing page with manual meta tag setup and multiple sections.",
  "frontend/src/pages/SetupChecklistPage.tsx": "Shows a configurable setup checklist detailing site configuration items and their statuses.",
  "frontend/src/pages/StudentFormPage.tsx": "Displays the student enquiry form with page metadata and a centered layout.",
  "frontend/src/pages/TeacherFormPage.tsx": "Displays the teacher registration form with metadata and structured layout.",
  "frontend/src/pages/TermsPage.tsx": "Renders terms and conditions content dynamically from legalContent with page metadata.",
  "frontend/src/types/backend-augment.d.ts": "Augments the backend interface with an internal admin initialization method for access control.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL or session-based parameters.",
  "frontend/static/growwithtutor-standalone/index.html": "Standalone landing page HTML with domain-config JS for setting logos and tracking links, plus layout for navigation and hero sections.",
  "frontend/static/growwithtutor-standalone/README.md": "Documentation for a standalone non-React landing page detailing files and usage instructions.",
  "frontend/static/growwithtutor-standalone/script.js": "Provides editable content data for the standalone page, including hero text, services, steps, testimonials, and FAQs.",
  "frontend/static/growwithtutor-standalone/styles.css": "Defines all styling for the standalone landing page, including layout, typography, color variables, components, and responsive behavior.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme settings, animations, colors, and plugins for the main frontend app.",
  "project_state.json": "Tracks project metadata, existing features, new feature requests, and domain-change requirements for the application."
}