{
  "kind": "build_request",
  "title": "Grant the logged-in user admin access to manage site content",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement a secure admin-bootstrap path in the backend so the currently authenticated Internet Identity principal can be promoted to admin using the existing secret-token initialization mechanism.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "now make me the admin so i can make changes"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes/uses an initialization flow that (a) requires a secret token and (b) can set the caller as the first admin when no admins exist yet.",
        "After successful initialization, backend admin authorization checks used by blog CRUD (create/edit/publish/delete) pass for the newly promoted admin principal.",
        "If the token is missing/invalid, the backend must not grant admin and must return a clear error (trap or rejected call).",
        "If an admin already exists, the initialization flow must not allow arbitrary promotion without appropriate authorization (e.g., must fail or require existing admin privileges)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add an admin setup UI that lets a logged-in user view their Principal ID, see whether they are currently an admin, and (when not admin) enter/provide the admin bootstrap secret and trigger the backend initialization so they can gain admin access and then navigate to the admin pages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "now make me the admin so i can make changes"
        ]
      },
      "acceptanceCriteria": [
        "A logged-in user can see their Principal ID in the UI (copyable/readable).",
        "The UI shows current admin status using the existing admin-status query hook(s).",
        "The UI provides a way to set/provide the bootstrap secret token (using the existing `caffeineAdminToken` parameter convention already used by the actor initialization logic) and trigger re-initialization so the backend is called with that token.",
        "On success, the UI updates to show the user is an admin and provides a working navigation path to `/admin/blogs`.",
        "All user-facing text is in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose with existing components only).",
    "Do not edit immutable hook entrypoints listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Backend must remain a single Motoko actor in backend/main.mo; only add migration.mo if a stable-state upgrade is required."
  ],
  "nonGoals": [
    "Building a full admin user management UI (e.g., listing users, role editor) beyond enabling the requesting user to become admin.",
    "Adding third-party authentication providers (only Internet Identity is supported).",
    "Adding real-time role updates via websockets/push notifications."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}