{
  "kind": "build_request",
  "title": "Deploy Version 30 to production",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Prepare and execute a production deployment for Version 30 to the Internet Computer mainnet, ensuring the deployed production canisters (backend + frontend) are accessible via the mainnet canister URLs and are not subject to draft expiration.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I want to give my version 30 for production"
        ]
      },
      "acceptanceCriteria": [
        "Running a mainnet deployment (e.g., via `dfx deploy --network ic`) completes successfully for both backend and frontend canisters.",
        "The app is reachable via the mainnet canister URL(s) after deployment and loads without errors.",
        "A short post-deploy verification is performed: load the home page, navigate to /blogs, and confirm admin routes remain gated behind Internet Identity as before."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update `frontend/DEPLOYMENT.md` to include a clear, end-to-end section for promoting an already-working version (Version 30) to production, including prerequisites (cycles), the exact command(s) to deploy to `--network ic`, and a brief note explaining that production deployments do not expire unlike drafts.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I want to give my version 30 for production"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/DEPLOYMENT.md` contains a dedicated, easy-to-follow section describing how to deploy to production (mainnet) and how to verify success.",
        "The documentation explicitly distinguishes draft expiration behavior from production (production does not expire)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services).",
    "Do not edit files under `frontend/src/components/ui` or any paths listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Adding new product features unrelated to deployment (e.g., new pages, new content, new auth providers).",
    "Changing the backend data model or requiring a state migration unless strictly necessary for deployment."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}