{
  "kind": "build_request",
  "title": "Support domain name change guidance and unpublish (maintenance mode) workflow",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Provide a clear, admin-only “Unpublish / Take site offline” action that immediately puts the site into maintenance mode (sets backend siteLive=false) and clearly explains that this hides the public site without rolling back the deployed canister version.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "please i want to change the domain name please unpublish the changes"
        ]
      },
      "acceptanceCriteria": [
        "When an authenticated admin visits /admin/blogs, they can perform an explicit action labeled in English as an unpublish/take-offline control (not just a generic toggle).",
        "Triggering the action sets backend siteLive to false and shows a success confirmation in the UI.",
        "After siteLive is false, all non-/admin routes render the maintenance screen, while /admin routes remain accessible.",
        "The admin UI includes explanatory English text that this is an application-level maintenance mode and does not roll back the deployed version."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Improve domain change support by making the public domain configuration steps explicit and discoverable in-app and in documentation, including the VITE_PUBLIC_DOMAIN environment variable and the standalone landing page domain note.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "please i want to change the domain name please unpublish the changes"
        ]
      },
      "acceptanceCriteria": [
        "Setup Checklist page shows the currently detected public domain and provides clear English instructions to change it via VITE_PUBLIC_DOMAIN or by editing the fallback in frontend/src/config/publicDomain.ts, and references frontend/DEPLOYMENT.md for full steps.",
        "frontend/DEPLOYMENT.md includes a complete, step-by-step section for changing the domain, explicitly mentioning VITE_PUBLIC_DOMAIN and calling out the standalone landing page domain configuration location (frontend/static/growwithtutor-standalone/index.html).",
        "No user-facing text related to domain change or unpublishing appears in a non-English language."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not modify immutable frontend hook/bootstrap files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx."
  ],
  "nonGoals": [
    "Implementing DNS changes or custom domain registration/verification on behalf of the user (DNS is external to the app).",
    "Rolling back the deployed Internet Computer canister version as a substitute for maintenance mode.",
    "Adding third-party authentication providers beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}