{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace marketing header/footer brand text with provided external logo URL (with fallback)",
  "requirements": [
    {
      "id": "REQ-5",
      "summary": "Render the provided external logo image in MarketingHeader while preserving home navigation, accessibility labeling, layout constraints, and a visible text fallback on image failure.",
      "acceptanceCriteria": [
        "In MarketingHeader, the brand area displays an <img> using src exactly \"https://growithtutor.com/wp-content/uploads/2025/08/cropped-cropped-growithtutor-3d-new-logo-150x150.png\".",
        "Clicking/tapping the brand area still navigates to '/'.",
        "The logo image includes meaningful alt text in English and does not break the header layout on mobile/desktop (logo is constrained to the header height).",
        "If the image fails to load, a text fallback brand name (\"Growithtutor\") is still visible."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/marketing/MarketingHeader.tsx",
          "operation": "modify",
          "description": "Replace the text-only brand mark with an <img> using src exactly \"https://growithtutor.com/wp-content/uploads/2025/08/cropped-cropped-growithtutor-3d-new-logo-150x150.png\"; keep the existing button click-to-navigate-home behavior and accessible labeling, constrain the image height to fit the header, and implement an onError-driven visible text fallback (\"Growithtutor\") when the image fails to load."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Render the provided external logo image in MarketingFooter without altering existing footer links/content, including accessible alt text, appropriate sizing, and a visible text fallback on image failure.",
      "acceptanceCriteria": [
        "In MarketingFooter, the brand area displays an <img> using src exactly \"https://growithtutor.com/wp-content/uploads/2025/08/cropped-cropped-growithtutor-3d-new-logo-150x150.png\".",
        "The logo image includes meaningful alt text in English and is visually sized appropriately for the footer (does not overflow or distort).",
        "If the image fails to load, a text fallback brand name (\"Growithtutor\") is still visible."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/marketing/MarketingFooter.tsx",
          "operation": "modify",
          "description": "Replace the text-only footer brand mark with an <img> using src exactly \"https://growithtutor.com/wp-content/uploads/2025/08/cropped-cropped-growithtutor-3d-new-logo-150x150.png\"; keep all existing footer links/content unchanged, constrain the logo sizing to prevent overflow/distortion, and add an onError-driven visible text fallback (\"Growithtutor\") when the image fails to load."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Mark the Setup Checklist 'Logo' item as complete and explicitly reference the configured external logo URL in its details.",
      "acceptanceCriteria": [
        "On SetupChecklistPage, the \"Logo\" item status is set to \"complete\".",
        "The \"Logo\" item details/reference clearly indicate the configured logo source URL is \"https://growithtutor.com/wp-content/uploads/2025/08/cropped-cropped-growithtutor-3d-new-logo-150x150.png\" (English text)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SetupChecklistPage.tsx",
          "operation": "modify",
          "description": "Update the 'Logo' checklist item to status \"complete\" and revise its description/details text to clearly state that the logo is configured via the external URL \"https://growithtutor.com/wp-content/uploads/2025/08/cropped-cropped-growithtutor-3d-new-logo-150x150.png\"."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Update the standalone static marketing page header and footer brand marks to use the provided external logo URL while preserving the rest of the page.",
      "acceptanceCriteria": [
        "In frontend/static/growwithtutor-standalone/index.html, the header logo area includes an <img> using src exactly \"https://growithtutor.com/wp-content/uploads/2025/08/cropped-cropped-growithtutor-3d-new-logo-150x150.png\".",
        "In frontend/static/growwithtutor-standalone/index.html, the footer logo area includes an <img> using src exactly \"https://growithtutor.com/wp-content/uploads/2025/08/cropped-cropped-growwithtutor-3d-new-logo-150x150.png\".",
        "Both images include meaningful alt text in English and are sized so they do not break the header/footer layout."
      ],
      "file_operations": [
        {
          "path": "frontend/static/growwithtutor-standalone/index.html",
          "operation": "modify",
          "description": "In the static standalone page, replace the header and footer text-only brand marks with <img> tags: header <img> src exactly \"https://growithtutor.com/wp-content/uploads/2025/08/cropped-cropped-growithtutor-3d-new-logo-150x150.png\" and footer <img> src exactly \"https://growithtutor.com/wp-content/uploads/2025/08/cropped-cropped-growwithtutor-3d-new-logo-150x150.png\"; add meaningful English alt text, ensure images are sized using existing CSS conventions (e.g., the logo image class) so layout does not break, and preserve the rest of the HTML unchanged."
        }
      ]
    }
  ]
}