{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin bootstrap setup UI for promoting the logged-in user to admin",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Create an admin setup page that shows the logged-in user’s Principal ID and admin status, allows entering the bootstrap secret (caffeineAdminToken), triggers actor re-initialization, and then provides navigation to /admin/blogs.",
      "acceptanceCriteria": [
        "A logged-in user can see their Principal ID in the UI (copyable/readable).",
        "The UI shows current admin status using the existing admin-status query hook(s).",
        "The UI provides a way to set/provide the bootstrap secret token (using the existing `caffeineAdminToken` parameter convention already used by the actor initialization logic) and trigger re-initialization so the backend is called with that token.",
        "On success, the UI updates to show the user is an admin and provides a working navigation path to `/admin/blogs`.",
        "All user-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminSetupPage.tsx",
          "operation": "create",
          "description": "Add an Admin Setup page UI for logged-in users that: displays the current Internet Identity Principal (with a copy action), shows current admin status via the existing useIsCallerAdmin hook, accepts a bootstrap secret token input, stores it under the `caffeineAdminToken` session key (so useActor picks it up via getSecretParameter), triggers React Query to recreate/refetch the actor, and on success shows a button/link that navigates to /admin/blogs. Use existing shadcn/ui composed components (e.g., Card, Button, Input, Label) without editing anything under frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new Admin Setup page into routing by registering a route (e.g., /admin/setup) in the TanStack router tree so it is reachable. Ensure the route is not wrapped by AdminRouteGuard (since it must be accessible to non-admin logged-in users who are bootstrapping)."
        },
        {
          "path": "frontend/src/components/auth/AdminRouteGuard.tsx",
          "operation": "modify",
          "description": "Update the unauthorized (authenticated but not admin) state to guide users to the new admin setup flow instead of requiring manual allowlist edits: keep showing the Principal ID, but add a clear call-to-action navigation to /admin/setup and update the English copy accordingly. Continue using existing shadcn/ui composed components (Card, Button, etc.) without editing UI component source. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/SetupChecklistPage.tsx",
          "operation": "modify",
          "description": "Revise the 'How to Get Admin Access' checklist section to reference the new /admin/setup flow (enter bootstrap secret, confirm admin status, then go to /admin/blogs) and remove/soften instructions that require rebuilding to edit adminAllowlist, keeping all text in English."
        },
        {
          "path": "frontend/src/utils/urlParams.ts",
          "operation": "modify",
          "description": "If needed to support the Admin Setup page, add/adjust a small utility to persist and clear the `caffeineAdminToken` in sessionStorage (reusing existing storeSessionParameter/clearSessionParameter) so the token can be applied for actor initialization and then removed after successful promotion."
        }
      ]
    }
  ]
}