{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-10T16:20:45.931Z",
  "summary": "Diff adds backend maintenance-mode state (siteLive) with admin-only setter and a frontend gate that shows a maintenance screen for non-/admin routes when the site is offline. It also adds in-app domain configuration guidance on the Setup Checklist page and updates DEPLOYMENT.md with maintenance mode documentation. Several additional unrelated frontend styling/marketing changes are present in the diff summary.",
  "missing_requirements": [
    {
      "id": "REQ-1",
      "requirement": "Admin-only /admin/blogs page provides an explicit English-labeled “Unpublish / Take site offline” control (not just a generic toggle), shows a success confirmation, and includes explanatory English text that this is application-level maintenance mode and does not roll back the deployed canister version.",
      "reason": "The /admin/blogs implementation is truncated right where the offline action handler begins, so the diff summary does not provide enough evidence that the UI includes (a) an explicit unpublish/take-offline labeled action (as opposed to only a Switch), (b) a success confirmation for the take-offline action, and (c) the required explanatory text in the admin UI.",
      "evidence": [
        "frontend/src/pages/AdminBlogsPage.tsx (truncated)"
      ]
    },
    {
      "id": "REQ-2",
      "requirement": "DEPLOYMENT.md includes a complete step-by-step domain change section explicitly mentioning VITE_PUBLIC_DOMAIN and calling out the standalone landing page domain configuration location (frontend/static/growwithtutor-standalone/index.html).",
      "reason": "DEPLOYMENT.md is truncated partway through the “Changing the Domain” section; the provided excerpt does not show explicit mention of VITE_PUBLIC_DOMAIN or the standalone landing page configuration path, so completeness cannot be verified from the diff summary.",
      "evidence": [
        "frontend/DEPLOYMENT.md (truncated)"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Broad marketing site content and section rewrites/additions (hero copy, value props, services, how-it-works, testimonials, FAQ, etc.) beyond domain-change guidance and maintenance-mode workflow.",
      "reason": "BuildRequest only asks for maintenance mode/unpublish workflow and domain-change guidance; marketing page content expansion is not requested.",
      "evidence": [
        "frontend-file-summaries.txt (frontend/src/content/marketingContent.ts)",
        "frontend-file-summaries.txt (frontend/src/pages/MarketingLandingPage.tsx)",
        "frontend-file-summaries.txt (frontend/src/components/marketing/sections/HeroSection.tsx)",
        "frontend-file-summaries.txt (frontend/src/components/marketing/sections/ValuePropositionSection.tsx)",
        "frontend-file-summaries.txt (frontend/src/components/marketing/sections/ServicesSection.tsx)",
        "frontend-file-summaries.txt (frontend/src/components/marketing/sections/HowItWorksSection.tsx)",
        "frontend-file-summaries.txt (frontend/src/components/marketing/sections/TestimonialsSection.tsx)",
        "frontend-file-summaries.txt (frontend/src/components/marketing/sections/FaqSection.tsx)",
        "frontend-file-summaries.txt (frontend/src/components/marketing/sections/ContactSection.tsx)",
        "frontend-file-summaries.txt (frontend/src/components/marketing/ContactForm.tsx)"
      ]
    },
    {
      "description": "Global styling and Tailwind theme changes unrelated to the requested maintenance-mode and domain-change guidance.",
      "reason": "No styling overhaul is requested in the BuildRequest.",
      "evidence": [
        "frontend-file-summaries.txt (frontend/src/index.css)",
        "frontend-file-summaries.txt (frontend/tailwind.config.js)"
      ]
    },
    {
      "description": "Standalone landing page refactor to inject runtime logo URL and define STANDALONE_PUBLIC_DOMAIN constant (beyond simply documenting the standalone domain configuration location).",
      "reason": "REQ-2 requires documentation/guidance and a note pointing to the standalone landing page domain configuration location; implementing additional standalone runtime injection behavior is not explicitly requested.",
      "evidence": [
        "frontend-file-summaries.txt (frontend/static/growwithtutor-standalone/index.html)"
      ]
    }
  ],
  "confidence": 0.62,
  "changed_files": [
    "backend/main.mo",
    "backend/migration.mo",
    "frontend-file-summaries.txt",
    "frontend/DEPLOYMENT.md",
    "frontend/src/components/maintenance/SiteLiveGate.tsx",
    "frontend/src/pages/AdminBlogsPage.tsx",
    "frontend/src/pages/SetupChecklistPage.tsx",
    "project_state.json"
  ]
}